#### Terraform Plan (welcome)

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs_service.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-north-1:982890094160:task-definition/welcome-web-task:5" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-north-1:982890094160:task-definition/welcome-web-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  ~ image            = "982890094160.dkr.ecr.eu-north-1.amazonaws.com/welcome-web:3038ab2a0e0b" -> "982890094160.dkr.ecr.eu-north-1.amazonaws.com/welcome-web:latest"
                  - mountPoints      = []
                    name             = "welcome-web"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "welcome-web-task" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "Environment" = "welcome"
            "ManagedBy"   = "terraform"
            "Name"        = "welcome-web-task"
            "Project"     = "welcome-web"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
*Pushed by: @shaeed-noordeen, Action: `pull_request`*